<a href="https://colab.research.google.com/github/lethikieuly/PANDAS-FUNCTION/blob/main/pandas_DataFrame_drop.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**STRUCTURE**

DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')

Remove rows or columns by specifying label names and corresponding axis, or by specifying directly index or column names

In [1]:
import pandas as pd

1/ Create a dataframe

In [2]:
df = pd.DataFrame([('Linda', 'Female', 40.8),
                   ('Asex', 'Female', 41.0),
                   ('Blax', 'male', 50),
                   ('Square', 'male', 60),
                   ('Page', 'male', 70),
                   ('Tompkins', 'male', 55),
                   ('Als Place', 'Female', 56.52)],
                  columns=('name', 'sex', 'Age')
                  )
df

        name     sex    Age
0      Linda  Female  40.80
1       Asex  Female  41.00
2       Blax    male  50.00
3     Square    male  60.00
4       Page    male  70.00
5   Tompkins    male  55.00
6  Als Place  Female  56.52

before drop -> create drop copy

In [3]:
df_copy=df.copy()

2/ Label, axis, column

labels: single label or list-like-> Index or column labels to drop.

axis: {0 or ‘index’, 1 or ‘columns’}, default 0 -> *Whether* *italicized text*to drop labels from the index (0 or ‘index’) or columns (1 or ‘columns’).

columns: single label or list-like-> Alternative to specifying axis (labels, axis=1 is equivalent to columns=labels).

In [4]:
df_copy.drop("name", axis=1)
#name is row name
#Result: remove "name" row

      sex    Age
0  Female  40.80
1  Female  41.00
2    male  50.00
3    male  60.00
4    male  70.00
5    male  55.00
6  Female  56.52

In [7]:
df_copy.drop(columns="name")

      sex    Age
0  Female  40.80
1  Female  41.00
2    male  50.00
3    male  60.00
4    male  70.00
5    male  55.00
6  Female  56.52

In [10]:
df_copy.drop(["name", "Age"],axis=1)

      sex
0  Female
1  Female
2    male
3    male
4    male
5    male
6  Female

Beside, you can drop rows how to drop rows ? 
You just use axis =0

In [11]:
#create df_copy_row
df_copy_row=df.copy()

In [12]:
df_copy_row.drop(1, axis=0)

        name     sex    Age
0      Linda  Female  40.80
2       Blax    male  50.00
3     Square    male  60.00
4       Page    male  70.00
5   Tompkins    male  55.00
6  Als Place  Female  56.52

In [16]:
df_copy_row.drop([2,3], axis=0)

        name     sex    Age
0      Linda  Female  40.80
1       Asex  Female  41.00
4       Page    male  70.00
5   Tompkins    male  55.00
6  Als Place  Female  56.52

3/ Index and errors

indexsingle:  label or list-like-> Alternative to specifying axis (labels, axis=0 is equivalent to index=labels).

errors:{‘ignore’, ‘raise’}, default ‘raise’->If ‘ignore’, suppress error and only existing labels are dropped.

In [14]:
df_copy_row.drop(index=3)
#Result index 3 remove from line

        name     sex    Age
0      Linda  Female  40.80
1       Asex  Female  41.00
2       Blax    male  50.00
4       Page    male  70.00
5   Tompkins    male  55.00
6  Als Place  Female  56.52

Say you accidentally reference a row or column that isn't in your dataset, this would normally raise an error. However you can surrpress this error by setting "errors" to 'ignore'

In [17]:
df_copy_row.drop("xyz",axis=1,errors="ignore")

        name     sex    Age
0      Linda  Female  40.80
1       Asex  Female  41.00
2       Blax    male  50.00
3     Square    male  60.00
4       Page    male  70.00
5   Tompkins    male  55.00
6  Als Place  Female  56.52